README.org

* Nome do Software (ou Biblioteca):
- CÁLCULO DOS FATORES DE RECUPERAÇÃO AVANÇADA DE PETROLEO À PARTIR DE TESTES DE FLUXO EM MEIO POROSO

* Resumo e/ou informação extra: 
- Calcular a permeabilidade absoluta de amostras rochosas;
- Obter grfico da permeabilidade absoluta da amostra (plugs );
- Calcular o volume poroso de amostras rochosas;
- Calcular as frações de recuperação de óleo a partir do método utilizado: Se-
cundário e/ou Avançado;
- Possibilitar a inclusão de informações de novosfuidos e amostras (plugs );
- Obter gráficos com as curvas de produção de água e de óleo através da re-
cuperaçao secundária e avançada a partir da entrada de dados pelo usuário
(volumes produzidos por minuto);
- Obter as saturações iniciais e finais dos fluidos injetados no meio poroso;
- Obter o fator de recuperação total de óleo através dos métodos de recuperação
utilizados.

* Versão: 
- 1.0.

* Data:
- 2013/2 - segundo semestre.
  
* Autor de Contato:
- André Duarte Bueno <andreduartebueno@gmail.com>

* Lista dos Autores:
- LAÍSA RIGUETI BRASIL
- André Duarte Bueno <andreduartebueno@gmail.com>

* Áreas de pesquisa vinculadas: 
- Modelagem Matemática Computacional
- Engenharia de Reservatório  

* Vinculo com: 
- Trabalho da disciplina de programação prática.

* Paradigmas: 
- POO - Programação Orientada a Objeto (códigos em C++)

* Tipo de Interface: 
- Terminal e gráfica (gnuplot).

* Plataformas Suportadas: 
- Windows e GNU/Linux e Mac OS X (não testada).

* Linguagens Utilizadas: 
- C++ 11.

* Bibliotecas Utilizadas (dependências):
- CGnuplot - https://github.com/ldsc/CGnuplot

* Softwares utilizados (dependências)
- gnuplot http://www.gnuplot.info/

* Tipo de Licença:
- GPL
- Entre em contato com o Prof. André Duarte Bueno
  andreduartebueno@gmail.com
  para que o mesmo gere um novo projeto no github do ldsc para que você (e sua equipe) possam trabalhar na nova versão.
- Se este projeto tem como número de versão 1.0 a nova versão deverá ser 2.0 e assim sucessivamente.
- Os nomes dos autores originais deve ser preservada na nova versão, ou seja, adicione a informação do número da versão, os nomes dos membros da nova equipe, mas jamais apague os nomes dos autores originais (isto seria plágio).
- Na descrição do projeto informe que trata-se de uma nova versão, que tem como base a versão anterior e DESTAQUE COM CLAREZA E OBJETIVIDADE QUAIS AS NOVIDADES DA NOVA VERSÃO.
  
* Links:

