README.md

# Table of Contents

1.  [Nome do Software (ou Biblioteca):](#org2846e5e)
2.  [Resumo e/ou informação extra:](#org4d2ea28)
3.  [Versão:](#orgfcaf013)
4.  [Data:](#org8fb4edd)
5.  [Autor de Contato:](#org3eb4354)
6.  [Lista dos Autores:](#org65875bc)
7.  [Áreas de pesquisa vinculadas:](#orga0a139f)
8.  [Vinculo com:](#org5c417e7)
9.  [Paradigmas:](#org6bb30df)
10. [Tipo de Interface:](#org0990c8f)
11. [Plataformas Suportadas:](#orgba2c095)
12. [Linguagens Utilizadas:](#org75c7138)
13. [Bibliotecas Utilizadas (dependências):](#orgf73de31)
14. [Softwares utilizados (dependências)](#org2888cf9)
15. [Tipo de Licença:](#orgc962981)
16. [Links:](#org07bc895)


<a id="org2846e5e"></a>

# Nome do Software (ou Biblioteca):

-   CÁLCULO DOS FATORES DE RECUPERAÇÃO AVANÇADA DE PETROLEO À PARTIR DE TESTES DE FLUXO EM MEIO POROSO


<a id="org4d2ea28"></a>

# Resumo e/ou informação extra:

-   Calcular a permeabilidade absoluta de amostras rochosas;
-   Obter grfico da permeabilidade absoluta da amostra (plugs );
-   Calcular o volume poroso de amostras rochosas;
-   Calcular as frações de recuperação de óleo a partir do método utilizado: Se-

cundário e/ou Avançado;

-   Possibilitar a inclusão de informações de novosfuidos e amostras (plugs );
-   Obter gráficos com as curvas de produção de água e de óleo através da re-

cuperaçao secundária e avançada a partir da entrada de dados pelo usuário
(volumes produzidos por minuto);

-   Obter as saturações iniciais e finais dos fluidos injetados no meio poroso;
-   Obter o fator de recuperação total de óleo através dos métodos de recuperação

utilizados.


<a id="orgfcaf013"></a>

# Versão:

-   1.0.


<a id="org8fb4edd"></a>

# Data:

-   2013/2 - segundo semestre.


<a id="org3eb4354"></a>

# Autor de Contato:

-   André Duarte Bueno <andreduartebueno@gmail.com>


<a id="org65875bc"></a>

# Lista dos Autores:

-   LAÍSA RIGUETI BRASIL
-   André Duarte Bueno <andreduartebueno@gmail.com>


<a id="orga0a139f"></a>

# Áreas de pesquisa vinculadas:

-   Modelagem Matemática Computacional
-   Engenharia de Reservatório


<a id="org5c417e7"></a>

# Vinculo com:

-   Trabalho da disciplina de programação prática.


<a id="org6bb30df"></a>

# Paradigmas:

-   POO - Programação Orientada a Objeto (códigos em C++)


<a id="org0990c8f"></a>

# Tipo de Interface:

-   Terminal e gráfica (gnuplot).


<a id="orgba2c095"></a>

# Plataformas Suportadas:

-   Windows e GNU/Linux e Mac OS X (não testada).


<a id="org75c7138"></a>

# Linguagens Utilizadas:

-   C++ 11.


<a id="orgf73de31"></a>

# Bibliotecas Utilizadas (dependências):

-   CGnuplot - <https://github.com/ldsc/CGnuplot>


<a id="org2888cf9"></a>

# Softwares utilizados (dependências)

-   gnuplot <http://www.gnuplot.info/>


<a id="orgc962981"></a>

# Tipo de Licença:

-   GPL
-   Entre em contato com o Prof. André Duarte Bueno
    andreduartebueno@gmail.com
    para que o mesmo gere um novo projeto no github do ldsc para que você (e sua equipe) possam trabalhar na nova versão.
-   Se este projeto tem como número de versão 1.0 a nova versão deverá ser 2.0 e assim sucessivamente.
-   Os nomes dos autores originais deve ser preservada na nova versão, ou seja, adicione a informação do número da versão, os nomes dos membros da nova equipe, mas jamais apague os nomes dos autores originais (isto seria plágio).
-   Na descrição do projeto informe que trata-se de uma nova versão, que tem como base a versão anterior e DESTAQUE COM CLAREZA E OBJETIVIDADE QUAIS AS NOVIDADES DA NOVA VERSÃO.


<a id="org07bc895"></a>

# Links:

